grblHAL/ESP32/main/driver.c
IRAM_ATTR static void spindleUpdateRPM (float rpm)
{
    spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
}

#endif

// Start or stop spindle, variable version

IRAM_ATTR void __attribute__ ((noinline)) _setSpeed (spindle_state_t state, float rpm)
{
    spindle_dir(state.ccw);
    spindle_set_speed(spindle_compute_pwm_value(&spindle_pwm, rpm, false));
}

IRAM_ATTR static void spindleSetStateVariable (spindle_state_t state, float rpm)
{
    if (!state.on || memcmp(&rpm, &FZERO, sizeof(float)) == 0) { // rpm == 0.0f cannot be used, causes intermittent panic on soft reset!
        spindle_set_speed(spindle_pwm.off_value);
        spindle_off();
    } else
        _setSpeed(state, rpm);
}

#else

// Sets spindle speed
IRAM_ATTR static void spindle_set_speed (uint_fast16_t pwm_value)
{
}

#ifdef SPINDLE_PWM_DIRECT

static uint_fast16_t spindleGetPWM (float rpm)
{
    return 0;
}

#else // Only enable if (when?) ESP IDF supports FPU access in ISR !!

IRAM_ATTR static void spindleUpdateRPM (float rpm)
{
}

#endif

// Start or stop spindle, variable version

IRAM_ATTR void __attribute__ ((noinline)) _setSpeed (spindle_state_t state, float rpm)
{
}

IRAM_ATTR static void spindleSetStateVariable (spindle_state_t state, float rpm)
{
}

#endif

IRAM_ATTR static void spindleOff (void)
{
    spindle_off();
}

// Returns spindle state in a spindle_state_t variable
static spindle_state_t spindleGetState (void)
{
    spindle_state_t state = {0};

#if IOEXPAND_ENABLE // TODO: read from expander?
    state.on = iopins.spindle_on;
    state.ccw = hal.driver_cap.spindle_dir && iopins.spindle_dir;
#elif defined(SPINDLE_ENABLE_PIN)
    state.on = gpio_get_level(SPINDLE_ENABLE_PIN) != 0;
  #if defined(SPINDLE_DIRECTION_PIN)
    state.ccw = hal.driver_cap.spindle_dir && gpio_get_level(SPINDLE_DIRECTION_PIN) != 0;
  #endif
#endif
    state.value ^= settings.spindle.invert.mask;
#ifdef SPINDLEPWMPIN
    state.on |= pwmEnabled;
  #if PWM_RAMPED
    state.at_speed = ledc_get_duty(ledConfig.speed_mode, ledConfig.channel) == pwm_ramp.pwm_target;
  #endif
#endif

    return state;
}

// end spindle code

#endif

// Start/stop coolant (and mist if enabled)
IRAM_ATTR static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;
#if IOEXPAND_ENABLE
    iopins.flood_on = mode.flood;
    iopins.mist_on = mode.mist;
    ioexpand_out(iopins);
#else
  #ifdef COOLANT_FLOOD_PIN
    gpio_set_level(COOLANT_FLOOD_PIN, mode.flood ? 1 : 0);
  #endif
  #ifdef COOLANT_MIST_PIN
    gpio_set_level(COOLANT_MIST_PIN, mode.mist ? 1 : 0);
  #endif
#endif
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

#if IOEXPAND_ENABLE // TODO: read from expander?
    state.flood = iopins.flood_on;
    state.mist = iopins.mist_on;
#else
  #ifdef COOLANT_FLOOD_PIN
    state.flood = gpio_get_level(COOLANT_FLOOD_PIN);
  #endif
  #ifdef COOLANT_MIST_PIN
    state.mist  = gpio_get_level(COOLANT_MIST_PIN);
  #endif
#endif

    state.value ^= settings.coolant_invert.mask;

    return state;
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
IRAM_ATTR static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    portENTER_CRITICAL(&mux);
    *ptr |= bits;
    portEXIT_CRITICAL(&mux);
}

IRAM_ATTR static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    portEXIT_CRITICAL(&mux);
    return prev;
}

IRAM_ATTR static uint_fast16_t valueSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t value)
{
    portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr = value;
    portEXIT_CRITICAL(&mux);
    return prev;
}

static void enable_irq (void)
{
    portEXIT_CRITICAL(&mux);
}

static void disable_irq (void)
{
    portENTER_CRITICAL(&mux);
}

#if MPG_MODE_ENABLE

static void modeChange(sys_state_t state)
{
    stream_mpg_enable(!gpio_get_level(MPG_ENABLE_PIN));
}

static void modeEnable (sys_state_t state)
{
    if(sys.mpg_mode == gpio_get_level(MPG_ENABLE_PIN))
        stream_mpg_enable(true);
}

#endif

void debounceTimerCallback (TimerHandle_t xTimer)
{
      uint32_t grp = 0, i = sizeof(inputpin) / sizeof(input_signal_t);
      do {
          i--;
          if(inputpin[i].debounce && inputpin[i].active) {
              inputpin[i].active = false; //gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
              grp |= inputpin[i].group;
          }
      } while(i);

//    printf("Debounce %d %d\n", grp, limitsGetState().value);

      if(grp & PinGroup_Limit)
            hal.limits.interrupt_callback(limitsGetState());

      if(grp & PinGroup_Control)
          hal.control.interrupt_callback(systemGetState());
}

gpio_int_type_t map_intr_type (pin_irq_mode_t mode)
{
    switch(mode) {
    case IRQ_Mode_Rising:
        return GPIO_INTR_POSEDGE;
        break;
    case IRQ_Mode_Falling:
        return GPIO_INTR_NEGEDGE;
        break;
    case IRQ_Mode_Change:
        return GPIO_INTR_ANYEDGE;
        break;
    case IRQ_Mode_Edges:
        return GPIO_INTR_DISABLE;
        break;
    case IRQ_Mode_High:
        return GPIO_INTR_HIGH_LEVEL;
        break;
    case IRQ_Mode_Low:
        return GPIO_INTR_LOW_LEVEL;
        break;
    default:
        break;
    }

    return GPIO_INTR_DISABLE;
}

// Configures perhipherals when settings are initialized or changed
static void settings_changed (settings_t *settings)
{

#if VFD_SPINDLE != 1 && defined(SPINDLEPWMPIN)

    if((hal.driver_cap.variable_spindle = settings->spindle.rpm_max > settings->spindle.rpm_min)) {

        if(ledTimerConfig.freq_hz != (uint32_t)settings->spindle.pwm_freq) {
            ledTimerConfig.freq_hz = (uint32_t)settings->spindle.pwm_freq;
            if(ledTimerConfig.freq_hz <= 100) {
                if(ledTimerConfig.duty_resolution != LEDC_TIMER_16_BIT) {
                    ledTimerConfig.duty_resolution = LEDC_TIMER_16_BIT;
                    ledc_timer_config(&ledTimerConfig);
                }
            } else if(ledTimerConfig.duty_resolution != LEDC_TIMER_10_BIT) {
                ledTimerConfig.duty_resolution = LEDC_TIMER_10_BIT;
                ledc_timer_config(&ledTimerConfig);
            }
        }

