grblHAL/ESP32/main/driver.c
    /********************
     *  Output signals  *
     ********************/

    uint32_t idx;
    for(idx = 0; idx < (N_AXIS + N_GANGED); idx++)
        rmt_set_source_clk(idx, RMT_BASECLK_APB);

    uint64_t mask = 0;
    idx = sizeof(outputpin) / sizeof(output_signal_t);
    do {
        if(outputpin[--idx].mode == Pin_GPIO)
            mask |= (1ULL << outputpin[idx].pin);
    } while(idx);

    gpio_config_t gpioConfig = {
        .pin_bit_mask = mask,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };

    gpio_config(&gpioConfig);

    idx = sizeof(outputpin) / sizeof(output_signal_t);
    do {
        idx--;
        if(outputpin[idx].group == PinGroup_MotorChipSelect || outputpin[idx].group == PinGroup_MotorUART)
            DIGITAL_OUT(outputpin[idx].pin, 1);
    } while(idx);

#if MPG_MODE_ENABLE

    /************************
     *  MPG mode (pre)init  *
     ************************/

    // Set as output low (until boot is complete)
    gpioConfig.pin_bit_mask = (1ULL << MPG_ENABLE_PIN);
    gpio_config(&gpioConfig);
    gpio_set_level(MPG_ENABLE_PIN, 0);

    serial2Init(BAUD_RATE);
#endif

   /****************************
    *  Software debounce init  *
    ****************************/

    if(hal.driver_cap.software_debounce)
        debounceTimer = xTimerCreate("debounce", pdMS_TO_TICKS(32), pdFALSE, NULL, debounceTimerCallback);

    /******************************************
     *  Control, limit & probe pins dir init  *
     ******************************************/

    gpio_isr_register(gpio_isr, NULL, (int)ESP_INTR_FLAG_IRAM, NULL);

#if VFD_SPINDLE != 1 && defined(SPINDLEPWMPIN)

    /******************
    *  Spindle init  *
    ******************/

#if PWM_RAMPED
    ledc_fade_func_install(ESP_INTR_FLAG_IRAM);
#endif
    ledConfig.speed_mode = ledTimerConfig.speed_mode;
    ledc_timer_config(&ledTimerConfig);
    ledc_channel_config(&ledConfig);

    static const periph_pin_t pwm = {
        .function = Output_SpindlePWM,
        .group = PinGroup_SpindlePWM,
        .pin = SPINDLEPWMPIN,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    hal.periph_port.register_pin(&pwm);

    /**/

#endif

#if SDCARD_ENABLE

    sdcard_events_t *card = sdcard_init();
    card->on_mount = sdcard_mount;
    card->on_unmount = sdcard_unmount;

    sdcard_mount(NULL);

    static const periph_pin_t sck = {
        .function = Output_SCK,
        .group = PinGroup_SPI,
        .pin = PIN_NUM_CLK,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t sdo = {
        .function = Output_MOSI,
        .group = PinGroup_SPI,
        .pin = PIN_NUM_MOSI,
        .mode = { .mask = PINMODE_NONE }
    };

    static const periph_pin_t sdi = {
        .function = Input_MISO,
        .group = PinGroup_SPI,
        .pin = PIN_NUM_MISO,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&sck);
    hal.periph_port.register_pin(&sdo);
    hal.periph_port.register_pin(&sdi);

#endif

#if IOEXPAND_ENABLE
    ioexpand_init();
#endif

#if WEBUI_ENABLE
    webui_init();
#endif

  // Set defaults

    IOInitDone = settings->version == 21;

    hal.settings_changed(settings);
    hal.stepper.go_idle(true);

    return IOInitDone;
}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    static char idf[48];

    strcpy(idf, esp_get_idf_version());

    hal.info = "ESP32";
    hal.driver_version = "220126";
#ifdef BOARD_NAME
    hal.board = BOARD_NAME;
#endif
    hal.driver_options = IDF_VER;
    hal.driver_setup = driver_setup;
    hal.f_step_timer = rtc_clk_apb_freq_get() / STEPPER_DRIVER_PRESCALER; // 20 MHz
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

#ifndef USE_I2S_OUT
    hal.stepper.wake_up = stepperWakeUp;
    hal.stepper.go_idle = stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = stepperCyclesPerTick;
    hal.stepper.pulse_start = stepperPulseStart;
#else
    hal.stepper.wake_up = I2S_stepperWakeUp;
    hal.stepper.go_idle = I2S_stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = I2S_stepperCyclesPerTick;
    hal.stepper.pulse_start = I2S_stepperPulseStart;
    i2s_out_init();
    i2s_out_set_pulse_callback(hal.stepper.interrupt_callback);
#endif
    hal.stepper.motor_iterator = motor_iterator;
#ifdef GANGING_ENABLED
    hal.stepper.get_ganged = getGangedAxes;
#endif
#ifdef SQUARING_ENABLED
    hal.stepper.disable_motors = StepperDisableMotors;
#endif

    hal.limits.enable = limitsEnable;
    hal.limits.get_state = limitsGetState;

    hal.coolant.set_state = coolantSetState;
    hal.coolant.get_state = coolantGetState;

#ifdef PROBE_PIN
    hal.probe.get_state = probeGetState;
    hal.probe.configure = probeConfigure;
#endif

#if VFD_SPINDLE != 1
    hal.spindle.set_state = spindleSetState;
    hal.spindle.get_state = spindleGetState;
  #ifdef SPINDLE_PWM_DIRECT
    hal.spindle.get_pwm = spindleGetPWM;
    hal.spindle.update_pwm = spindle_set_speed;
  #else
    hal.spindle.update_rpm = spindleUpdateRPM; // NOTE: fails in laser mode as ESP32 does not handle FPU access in ISRs!
  #endif
    hal.spindle.esp32_off = spindleOff;
#endif

    hal.control.get_state = systemGetState;

//    hal.reboot = esp_restart; crashes the MCU...
    hal.irq_enable = enable_irq;
    hal.irq_disable = disable_irq;
#if I2C_STROBE_ENABLE
    hal.irq_claim = irq_claim;
#endif
    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;
    hal.get_elapsed_ticks = xTaskGetTickCountFromISR;
    hal.enumerate_pins = enumeratePins;
    hal.periph_port.register_pin = registerPeriphPin;
    hal.periph_port.set_pin_description = setPeriphPinDescription;

    stream_connect(serialInit(BAUD_RATE));

