grblHAL/ESP32/main/driver.c
#if I2C_ENABLE
    I2CInit();
#endif

#if EEPROM_ENABLE
    i2c_eeprom_init();
#else
    if(nvsInit()) {
        hal.nvs.type = NVS_Flash;
        hal.nvs.memcpy_from_flash = nvsRead;
        hal.nvs.memcpy_to_flash = nvsWrite;
    } else
        hal.nvs.type = NVS_None;
#endif

#ifdef DEBUGOUT
    hal.debug_out = debug_out;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

#if VFD_SPINDLE != 1
  #if IOEXPAND_ENABLE || defined(SPINDLE_DIRECTION_PIN)
    hal.driver_cap.spindle_dir = On;
  #endif
  #ifdef SPINDLEPWMPIN
    hal.driver_cap.variable_spindle = On;
    hal.driver_cap.spindle_pwm_invert = On;
   #if PWM_RAMPED
    hal.driver_cap.spindle_at_speed = On;
   #endif
  #endif
  #if IOEXPAND_ENABLE || defined(COOLANT_MIST_PIN)
    hal.driver_cap.mist_control = On;
  #endif
#endif
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#ifdef SAFETY_DOOR_PIN
    hal.signals_cap.safety_door_ajar = On;
#endif
#if MPG_MODE_ENABLE
    hal.driver_cap.mpg_mode = stream_mpg_register(serial2Init(115200), true, NULL);
#endif

#ifdef HAS_IOPORTS

    uint32_t i;
    static pin_group_pins_t aux_inputs = {0}, aux_outputs = {0};
    input_signal_t *input;
    output_signal_t *output;

    for(i = 0 ; i < sizeof(inputpin) / sizeof(input_signal_t); i++) {
        input = &inputpin[i];
        if(input->group == PinGroup_AuxInput) {
            if(aux_inputs.pins.inputs == NULL)
                aux_inputs.pins.inputs = input;
            input->cap.pull_mode = PullMode_UpDown;
            input->cap.irq_mode = IRQ_Mode_Edges;
            aux_inputs.n_pins++;
        }
    }

    for(i = 0 ; i < sizeof(outputpin) / sizeof(output_signal_t); i++) {
        output = &outputpin[i];
        if(output->group == PinGroup_AuxOutput) {
            if(aux_outputs.pins.outputs == NULL)
                aux_outputs.pins.outputs = output;
            aux_outputs.n_pins++;
        }
    }

    ioports_init(&aux_inputs, &aux_outputs);

#endif

    serialRegisterStreams();

#ifdef HAS_BOARD_INIT
    board_init();
#endif

#if WIFI_ENABLE
    wifi_init();
#endif

#if BLUETOOTH_ENABLE
    bluetooth_init();
#endif

#include "grbl/plugins_init.h"

    // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 9;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
    TIMERG0.int_clr_timers.t0 = 1;
    TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;
    
    hal.stepper.interrupt_callback();
}

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
    bool debounce = false;
    uint32_t grp = 0, intr_status[2];
    intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);          // get interrupt status for GPIO0-31
    intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);         // get interrupt status for GPIO32-39
    SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
    SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]); // clear intr for gpio32-39

    uint32_t i = sizeof(inputpin) / sizeof(input_signal_t);
    do {
        i--;
        if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
#ifdef HAS_IOPORTS
            if(inputpin[i].group & PinGroup_AuxInput)
                ioports_event(&inputpin[i]);
            else {
#endif
            inputpin[i].active = true;
            if(inputpin[i].debounce)
                debounce = true;
            else
                grp |= inputpin[i].group;
#ifdef HAS_IOPORTS
            }
#endif
        }
    } while(i);

    if(debounce) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
    }

    if(grp & PinGroup_Limit)
        hal.limits.interrupt_callback(limitsGetState());

    if(grp & PinGroup_Control)
        hal.control.interrupt_callback(systemGetState());

#if MPG_MODE_ENABLE

    static bool mpg_mutex = false;

    if((grp & PinGroup_MPG) && !mpg_mutex) {
        mpg_mutex = true;
        protocol_enqueue_rt_command(modeChange);
        mpg_mutex = false;
    }
#endif

#if I2C_STROBE_ENABLE
    if((grp & PinGroup_Keypad) && i2c_strobe.callback)
        i2c_strobe.callback(0, gpio_get_level(I2C_STROBE_PIN));
#endif
}
